---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DesignOptionId
source: html/29e3678d-f631-5720-9f16-5476ad08d5de.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DesignOptionId Property

"Design Option"

## Syntax (C#)
```csharp
public static ForgeTypeId DesignOptionId { get; }
```